import pandas as pds

basicData = {'证券名称': ['格力电器', '视觉中国', '成都银行', '中国联通', '格力电器', '视觉中国', '成都银行', '中国联通'],
             '摘要': ['证券买入', '证券买入', '证券买入', '证券买入', '证券卖出', '证券卖出', '证券卖出', '证券卖出'],
             '成交数量': [500, 1000, 1500, 2000, 500, 500, 1000, 1500],
             '成交金额': [-5000, -10000, -15000, -20000, 5500, 5500, 11000, 15000]
             }

showResult = pds.DataFrame(basicData, index=['2018-2-1', '2018-2-1', '2018-2-1', '2018-2-1',
                                             '2018-2-2', '2018-2-2', '2018-2-2', '2018-2-3'])

print("=== 1.选择成交金额小于 1000 的数据 ==================")
df1 = showResult[showResult["成交金额"] < 1000]
print(df1)


print("=== 2. 选择证券名称是视觉中国，并且成交数量小于 1000 的数据 ==================")
df2 = showResult[(showResult["证券名称"] == "视觉中国") & (showResult["成交数量"] < 1000)]
print(df2)


print("=== 3. 选择成交数量大于等于 2000 或者 成交金额大于等于 10000 的数据 ==================")
df3 = showResult[(showResult["成交数量"] >= 2000) | (showResult["成交金额"] >= 10000)]
print(df3)

print("=== 4. 选择证券名称是”格力电器“和”成都银行“的数据===================")
df4 = showResult[showResult["证券名称"].isin(['格力电器', '成都银行'])]
print(df4)

print("=== 5. 选择证券名称中包含”联通“的数据==================")
df5 = showResult[~ showResult['证券名称'].str.contains('联通')]
print(df5)

print("=== 6. 选择证券名称中不包含”联通“的数据 ==================")
df6 = showResult[showResult['证券名称'].str.contains('联通')]
print(df6)
